/**********************************************/
/* PRIORITY 1 */
/**********************************************/

"Backup & Restore" =
"Backup & Restore";

/* No comment provided by engineer. */
"No Backups Found" = "No Backups Found";

/* No comment provided by engineer. */
"Restore Backup Now" = "Restore Backup Now";

/* otherButtonTitles */
"Restore Now" = "Restore Now";

/* UIAlert title */
"Restore Successful" = "Restore Successful";


"Uploaded: %1.1f%%" =
"Uploaded: %1.1f%%";

"Uploaded: %1.2f%%" =
"Uploaded: %1.2f%%";

"Downloaded: %1.2f%%" =
"Downloaded: %1.2f%%";

"Load Backup File" =
"Load Backup File";

"Are you sure you want to load this backup file? It will overwrite ALL of your current FlashCards++ data." =
"Are you sure you want to load this backup file? It will overwrite ALL of your current FlashCards++ data.";

"Load File Now" =
"Load File Now";

"Make A Backup First" =
"Make A Backup First";

/* UIBarButtonItem */
"Backup Now" = "Backup Now";

/* message */
"Are you sure you want to restore this database file? Please make sure that your current database is backed up before restoring to a previous version." =
"Are you sure you want to restore this database file? Please make sure that your current database is backed up before restoring to a previous version.";

"Are you sure you want to restore this database file? It will turn off automatic sync and replace your current data with this backup version." =
"Are you sure you want to restore this database file? It will turn off automatic sync and replace your current data with this backup version.";

"Upload Database Now" =
"Upload Database Now";

"Do you want to optimize your FlashCards++ database before uploading it?" =
"Do you want to optimize your FlashCards++ database before uploading it?";

/* No comment provided by engineer. */
"FlashCards++ uses the free Dropbox service to store backups in the cloud. Please sign in or create a free Dropbox account below to set up backups." =
"FlashCards++ uses the free Dropbox service to store backups in the cloud. Please sign in or create a free Dropbox account below to set up backups.";


/* uploadingLabel */
"Downloading Restore File" = "Downloading Restore File";


/* UIView title */
"Backup Settings" = "Backup Settings";


/**********************************************/
/* PRIORITY 2 */
/**********************************************/


/* message */
"FlashCards++ has successfully backed up its database to Dropbox." = "FlashCards++ has successfully backed up its database to Dropbox.";

/* message */
"FlashCards++ has successfully restored its database." = "FlashCards++ has successfully restored its database.";


/* UITextField */
"Create a new folder and use it to store your FlashCards++ backup files:" =
"Create a new folder and use it to store your FlashCards++ backup files:";

/* UILabel */
"Name of New Folder:" = "Name of New Folder:";

/* No comment provided by engineer. */
"No Sub-Folders Found" = "No Sub-Folders Found";



/* UIView title */
"Backup Information" = "Backup Information";

/* UIView title */
"Backup Location" = "Backup Location";



/* No comment provided by engineer. */
"Backup Date" = "Backup Date";

/* file size */
"Size" = "Size";

/* No comment provided by engineer. */
"Current Backup Location" = "Current Backup Location";

/* No comment provided by engineer. */
"Last Backup" = "Last Backup";

/* UIBarButtonItem */
"Backup to Current Folder" = "Backup to Current Folder";

/* No comment provided by engineer. */
"Backups" = "Backups";

/* No comment provided by engineer. */
"Choose Backup Location" = "Choose Backup Location";

/* UIView title */
"Create Folder" = "Create Folder";

/* UIAlert title */
"Duplicate File" = "Duplicate File";

/* UIAlert title */
"Invalid Folder Name" = "Invalid Folder Name";

/* otherButtonTitles */
"Overwrite File" = "Overwrite File";

/**********************************************/
/* PRIORITY 3 */
/**********************************************/

/* message */
"It appears that a backup file already exists in this location with the name \"%@\". Continuing with your backup will overwrite this file. Would you like to overwrite this file?" = "It appears that a backup file already exists in this location with the name \"%@\". Continuing with your backup will overwrite this file. Would you like to overwrite this file?";

/* message */
"Please enter a valid name for your new folder; it may not contain forward-slashes, back-slashes, or periods." = "Please enter a valid name for your new folder; it may not contain forward-slashes, back-slashes, or periods.";

/* message */
"You did not enter a name for your new folder." = "You did not enter a name for your new folder.";

/**********************************************/
/* PRIORITY END */

